Code/Analysis/data/M05CA75/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default none;
    grad(Us) Gauss linear;
}

divSchemes
{
    default Gauss linear;
}

laplacianSchemes
{
    default             none;
}

interpolationSchemes
{
    default none;
}

snGradSchemes
{
    default none;
}

fluxRequired
{
}

// ************************************************************************* //
